## Sales cleaning and Analysis

### step 1: Import Libraries

In [1]:
import pandas as pd
import numpy as np

### step2: Load the Dataset

In [2]:
df=pd.read_csv("data.csv",encoding ='ISO-8859-1')

### step3: Basic Data Exploration

In [3]:
df.shape

(541909, 8)

In [4]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [5]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [6]:
df.tail()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/2011 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/2011 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/2011 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/2011 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/2011 12:50,4.95,12680.0,France

In [7]:
df.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [8]:
for i in df.columns:
    print(i)

InvoiceNo
StockCode
Description
Quantity
InvoiceDate
UnitPrice
CustomerID
Country

### Rename Columns

In [9]:
d={
    "InvoiceNo":'invoice_num',
    "StockCode":'stock_code',
    'Description':'description',
    'Quantity':'quantity',
    'InvoiceDate':'invoice_date',
    'UnitPrice':'unit_price',
    'CustomerID':'customer_id',
    'Country':'country'
}

In [10]:
d

{'InvoiceNo': 'invoice_num',
 'StockCode': 'stock_code',
 'Description': 'description',
 'Quantity': 'quantity',
 'InvoiceDate': 'invoice_date',
 'UnitPrice': 'unit_price',
 'CustomerID': 'customer_id',
 'Country': 'country'}

In [11]:
df.rename(columns = d, inplace=True)

In [12]:
df.columns

Index(['invoice_num', 'stock_code', 'description', 'quantity', 'invoice_date',
       'unit_price', 'customer_id', 'country'],
      dtype='object')

In [13]:
df.shape[1]

8

In [14]:
df.isnull().sum()

invoice_num          0
stock_code           0
description       1454
quantity             0
invoice_date         0
unit_price           0
customer_id     135080
country              0
dtype: int64

In [15]:
df.isna().sum().sort_values()

invoice_num          0
stock_code           0
quantity             0
invoice_date         0
country              0
unit_price           0
description       1454
customer_id     135080
dtype: int64

In [16]:
df.isna().sum().sort_values(ascending=False)

customer_id     135080
description       1454
stock_code           0
invoice_num          0
quantity             0
invoice_date         0
unit_price           0
country              0
dtype: int64

In [17]:
df.dtypes

invoice_num      object
stock_code       object
description      object
quantity          int64
invoice_date     object
unit_price      float64
customer_id     float64
country          object
dtype: object

In [18]:
df.invoice_date

0          12/1/2010 8:26
1          12/1/2010 8:26
2          12/1/2010 8:26
3          12/1/2010 8:26
4          12/1/2010 8:26
               ...
541904    12/9/2011 12:50
541905    12/9/2011 12:50
541906    12/9/2011 12:50
541907    12/9/2011 12:50
541908    12/9/2011 12:50
Name: invoice_date, Length: 541909, dtype: object

In [19]:
df['invoice_date']=pd.to_datetime(df.invoice_date, format = '%m/%d/%Y %H:%M')

In [20]:
df.dtypes

invoice_num             object
stock_code              object
description             object
quantity                 int64
invoice_date    datetime64[ns]
unit_price             float64
customer_id            float64
country                 object
dtype: object

In [21]:
df.shape[1]

8

In [22]:
df.description

0          WHITE HANGING HEART T-LIGHT HOLDER
1                         WHITE METAL LANTERN
2              CREAM CUPID HEARTS COAT HANGER
3         KNITTED UNION FLAG HOT WATER BOTTLE
4              RED WOOLLY HOTTIE WHITE HEART.
                         ...
541904            PACK OF 20 SPACEBOY NAPKINS
541905           CHILDREN'S APRON DOLLY GIRL
541906          CHILDRENS CUTLERY DOLLY GIRL
541907        CHILDRENS CUTLERY CIRCUS PARADE
541908          BAKING SET 9 PIECE RETROSPOT
Name: description, Length: 541909, dtype: object

In [23]:
df['description']=df.description.str.lower()

In [24]:
df.description

0          white hanging heart t-light holder
1                         white metal lantern
2              cream cupid hearts coat hanger
3         knitted union flag hot water bottle
4              red woolly hottie white heart.
                         ...
541904            pack of 20 spaceboy napkins
541905           children's apron dolly girl
541906          childrens cutlery dolly girl
541907        childrens cutlery circus parade
541908          baking set 9 piece retrospot
Name: description, Length: 541909, dtype: object

In [25]:
df.shape[1]

8

In [26]:
df.isna().sum().sort_values()

invoice_num          0
stock_code           0
quantity             0
invoice_date         0
country              0
unit_price           0
description       1454
customer_id     135080
dtype: int64

In [27]:
df_new = df.dropna()

In [28]:
df_new.head()

,invoice_num,stock_code,description,quantity,invoice_date,unit_price,customer_id,country
0,536365,85123A,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,white metal lantern,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [29]:
df_new.dtypes

invoice_num             object
stock_code              object
description             object
quantity                 int64
invoice_date    datetime64[ns]
unit_price             float64
customer_id            float64
country                 object
dtype: object

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice_num   541909 non-null  object
 1   stock_code    541909 non-null  object
 2   description   540455 non-null  object
 3   quantity      541909 non-null  int64
 4   invoice_date  541909 non-null  datetime64[ns]
 5   unit_price    541909 non-null  float64
 6   customer_id   406829 non-null  float64
 7   country       541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [31]:
df_new.isna().sum().sort_values()

invoice_num     0
stock_code      0
description     0
quantity        0
invoice_date    0
unit_price      0
customer_id     0
country         0
dtype: int64

In [32]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 406829 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice_num   406829 non-null  object
 1   stock_code    406829 non-null  object
 2   description   406829 non-null  object
 3   quantity      406829 non-null  int64
 4   invoice_date  406829 non-null  datetime64[ns]
 5   unit_price    406829 non-null  float64
 6   customer_id   406829 non-null  float64
 7   country       406829 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 27.9+ MB

In [33]:
df_new['customer_id']=df_new.customer_id.astype(int)

C:\Users\dell\AppData\Local\Temp\ipykernel_12072\1515016634.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new['customer_id']=df_new.customer_id.astype(int)

In [34]:
import warnings
warnings.filterwarnings('ignore')

In [35]:
df_new['customer_id']=df_new.customer_id.astype(int)

In [36]:
df_new.dtypes

invoice_num             object
stock_code              object
description             object
quantity                 int64
invoice_date    datetime64[ns]
unit_price             float64
customer_id              int64
country                 object
dtype: object

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice_num   541909 non-null  object
 1   stock_code    541909 non-null  object
 2   description   540455 non-null  object
 3   quantity      541909 non-null  int64
 4   invoice_date  541909 non-null  datetime64[ns]
 5   unit_price    541909 non-null  float64
 6   customer_id   406829 non-null  float64
 7   country       541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [38]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 406829 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice_num   406829 non-null  object
 1   stock_code    406829 non-null  object
 2   description   406829 non-null  object
 3   quantity      406829 non-null  int64
 4   invoice_date  406829 non-null  datetime64[ns]
 5   unit_price    406829 non-null  float64
 6   customer_id   406829 non-null  int64
 7   country       406829 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 27.9+ MB

In [39]:
df_new.shape[1]

8

In [40]:
df_new.describe()

,quantity,invoice_date,unit_price,customer_id
count,406829.000000,406829,406829.000000,406829.000000
mean,12.061303,2011-07-10 16:30:57.879207424,3.460471,15287.690570
min,-80995.000000,2010-12-01 08:26:00,0.000000,12346.000000
25%,2.000000,2011-04-06 15:02:00,1.250000,13953.000000
50%,5.000000,2011-07-31 11:48:00,1.950000,15152.000000
75%,12.000000,2011-10-20 13:06:00,3.750000,16791.000000
max,80995.000000,2011-12-09 12:50:00,38970.000000,18287.000000
std,248.693370,NaN,69.315162,1713.600303

In [41]:
df_new.describe().round()

       quantity                   invoice_date  unit_price  customer_id
count  406829.0                         406829    406829.0     406829.0
mean       12.0  2011-07-10 16:30:57.879207424         3.0      15288.0
min    -80995.0            2010-12-01 08:26:00         0.0      12346.0
25%         2.0            2011-04-06 15:02:00         1.0      13953.0
50%         5.0            2011-07-31 11:48:00         2.0      15152.0
75%        12.0            2011-10-20 13:06:00         4.0      16791.0
max     80995.0            2011-12-09 12:50:00     38970.0      18287.0
std       249.0                            NaN        69.0       1714.0

In [42]:
df_new.describe().round(2)

        quantity                   invoice_date  unit_price  customer_id
count  406829.00                         406829   406829.00    406829.00
mean       12.06  2011-07-10 16:30:57.879207424        3.46     15287.69
min    -80995.00            2010-12-01 08:26:00        0.00     12346.00
25%         2.00            2011-04-06 15:02:00        1.25     13953.00
50%         5.00            2011-07-31 11:48:00        1.95     15152.00
75%        12.00            2011-10-20 13:06:00        3.75     16791.00
max     80995.00            2011-12-09 12:50:00    38970.00     18287.00
std       248.69                            NaN       69.32      1713.60

# remove /delete negative value

In [43]:
df_new.quantity>0

0         True
1         True
2         True
3         True
4         True
          ...
541904    True
541905    True
541906    True
541907    True
541908    True
Name: quantity, Length: 406829, dtype: bool

In [44]:
con = df_new.quantity>0

In [45]:
df_new = df_new[con]

In [46]:
df_new.describe().round()

       quantity                   invoice_date  unit_price  customer_id
count  397924.0                         397924    397924.0     397924.0
mean       13.0  2011-07-10 23:43:36.912475648         3.0      15294.0
min         1.0            2010-12-01 08:26:00         0.0      12346.0
25%         2.0            2011-04-07 11:12:00         1.0      13969.0
50%         6.0            2011-07-31 14:39:00         2.0      15159.0
75%        12.0            2011-10-20 14:33:00         4.0      16795.0
max     80995.0            2011-12-09 12:50:00      8143.0      18287.0
std       180.0                            NaN        22.0       1713.0

#access intial data

# access intial data

In [47]:
df_new.head()

,invoice_num,stock_code,description,quantity,invoice_date,unit_price,customer_id,country
0,536365,85123A,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom
1,536365,71053,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
2,536365,84406B,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom
3,536365,84029G,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom
4,536365,84029E,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom

In [48]:
df_new.shape

(397924, 8)

## adding a new column

In [49]:
df_new['amount_spent'] = df_new['quantity'] * df_new['unit_price']

In [50]:
df_new.head()

,invoice_num,stock_code,description,quantity,invoice_date,unit_price,customer_id,country,amount_spent
0,536365,85123A,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,536365,84029G,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,536365,84029E,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

In [51]:
df_new.shape

(397924, 9)

In [52]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 397924 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   invoice_num   397924 non-null  object
 1   stock_code    397924 non-null  object
 2   description   397924 non-null  object
 3   quantity      397924 non-null  int64
 4   invoice_date  397924 non-null  datetime64[ns]
 5   unit_price    397924 non-null  float64
 6   customer_id   397924 non-null  int64
 7   country       397924 non-null  object
 8   amount_spent  397924 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(4)
memory usage: 30.4+ MB

In [53]:
df_new.describe()

,quantity,invoice_date,unit_price,customer_id,amount_spent
count,397924.000000,397924,397924.000000,397924.000000,397924.000000
mean,13.021823,2011-07-10 23:43:36.912475648,3.116174,15294.315171,22.394749
min,1.000000,2010-12-01 08:26:00,0.000000,12346.000000,0.000000
25%,2.000000,2011-04-07 11:12:00,1.250000,13969.000000,4.680000
50%,6.000000,2011-07-31 14:39:00,1.950000,15159.000000,11.800000
75%,12.000000,2011-10-20 14:33:00,3.750000,16795.000000,19.800000
max,80995.000000,2011-12-09 12:50:00,8142.750000,18287.000000,168469.600000
std,180.420210,NaN,22.096788,1713.169877,309.055588

## rearrange col_name

In [54]:
df_new.columns

Index(['invoice_num', 'stock_code', 'description', 'quantity', 'invoice_date',
       'unit_price', 'customer_id', 'country', 'amount_spent'],
      dtype='object')

In [55]:
col_order = ['invoice_num','invoice_date','description','quantity','stock_code',
       'unit_price','customer_id','country','amount_spent']

In [56]:
df_new = df_new[col_order]

In [57]:
df_new.shape

(397924, 9)

# access column method 1

In [58]:
df_new['invoice_date']

0        2010-12-01 08:26:00
1        2010-12-01 08:26:00
2        2010-12-01 08:26:00
3        2010-12-01 08:26:00
4        2010-12-01 08:26:00
                 ...
541904   2011-12-09 12:50:00
541905   2011-12-09 12:50:00
541906   2011-12-09 12:50:00
541907   2011-12-09 12:50:00
541908   2011-12-09 12:50:00
Name: invoice_date, Length: 397924, dtype: datetime64[ns]

# access column method2

In [59]:
df_new.invoice_date

0        2010-12-01 08:26:00
1        2010-12-01 08:26:00
2        2010-12-01 08:26:00
3        2010-12-01 08:26:00
4        2010-12-01 08:26:00
                 ...
541904   2011-12-09 12:50:00
541905   2011-12-09 12:50:00
541906   2011-12-09 12:50:00
541907   2011-12-09 12:50:00
541908   2011-12-09 12:50:00
Name: invoice_date, Length: 397924, dtype: datetime64[ns]

In [60]:
df_new.invoice_date.dt.month

0         12
1         12
2         12
3         12
4         12
          ..
541904    12
541905    12
541906    12
541907    12
541908    12
Name: invoice_date, Length: 397924, dtype: int32

In [61]:
df_new.invoice_date.dt.year

0         2010
1         2010
2         2010
3         2010
4         2010
          ...
541904    2011
541905    2011
541906    2011
541907    2011
541908    2011
Name: invoice_date, Length: 397924, dtype: int32

In [62]:
y = 2010
m = 12

In [63]:
y_m = 100*2010 + 12

In [64]:
y_m

201012

In [65]:
c1='year_month'

In [66]:
v1 = df_new['invoice_date'].map(lambda col: 100*(col.year) + col.month)

In [67]:
df_new.insert(loc = 2, column = c1, value = v1)

In [68]:
df_new

,invoice_num,invoice_date,year_month,description,quantity,stock_code,unit_price,customer_id,country,amount_spent
0,536365,2010-12-01 08:26:00,201012,white hanging heart t-light holder,6,85123A,2.55,17850,United Kingdom,15.30
1,536365,2010-12-01 08:26:00,201012,white metal lantern,6,71053,3.39,17850,United Kingdom,20.34
2,536365,2010-12-01 08:26:00,201012,cream cupid hearts coat hanger,8,84406B,2.75,17850,United Kingdom,22.00
3,536365,2010-12-01 08:26:00,201012,knitted union flag hot water bottle,6,84029G,3.39,17850,United Kingdom,20.34
4,536365,2010-12-01 08:26:00,201012,red woolly hottie white heart.,6,84029E,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...
541904,581587,2011-12-09 12:50:00,201112,pack of 20 spaceboy napkins,12,22613,0.85,12680,France,10.20
541905,581587,2011-12-09 12:50:00,201112,children's apron dolly girl,6,22899,2.10,12680,France,12.60
541906,581587,2011-12-09 12:50:00,201112,childrens cutlery dolly girl,4,23254,4.15,12680,France,16.60
541907,581587,2011-12-09 12:50:00,201112,childrens cutlery circus parade,4,23255,4.15,12680,France,16.60
541908,581587,2011-12-09 12:50:00,201112,baking set 9 piece retrospot,3,22138,4.95,12680,France,14.85

In [69]:
df_new.columns

Index(['invoice_num', 'invoice_date', 'year_month', 'description', 'quantity',
       'stock_code', 'unit_price', 'customer_id', 'country', 'amount_spent'],
      dtype='object')

In [70]:
df_new.head()

,invoice_num,invoice_date,year_month,description,quantity,stock_code,unit_price,customer_id,country,amount_spent
0,536365,2010-12-01 08:26:00,201012,white hanging heart t-light holder,6,85123A,2.55,17850,United Kingdom,15.30
1,536365,2010-12-01 08:26:00,201012,white metal lantern,6,71053,3.39,17850,United Kingdom,20.34
2,536365,2010-12-01 08:26:00,201012,cream cupid hearts coat hanger,8,84406B,2.75,17850,United Kingdom,22.00
3,536365,2010-12-01 08:26:00,201012,knitted union flag hot water bottle,6,84029G,3.39,17850,United Kingdom,20.34
4,536365,2010-12-01 08:26:00,201012,red woolly hottie white heart.,6,84029E,3.39,17850,United Kingdom,20.34

In [71]:
c2 = 'month'

In [72]:
v2 = df_new.invoice_date.dt.month

In [73]:
df_new.insert(loc = 3, column = c2, value = v2)

In [74]:
df_new.head()

,invoice_num,invoice_date,year_month,month,description,quantity,stock_code,unit_price,customer_id,country,amount_spent
0,536365,2010-12-01 08:26:00,201012,12,white hanging heart t-light holder,6,85123A,2.55,17850,United Kingdom,15.30
1,536365,2010-12-01 08:26:00,201012,12,white metal lantern,6,71053,3.39,17850,United Kingdom,20.34
2,536365,2010-12-01 08:26:00,201012,12,cream cupid hearts coat hanger,8,84406B,2.75,17850,United Kingdom,22.00
3,536365,2010-12-01 08:26:00,201012,12,knitted union flag hot water bottle,6,84029G,3.39,17850,United Kingdom,20.34
4,536365,2010-12-01 08:26:00,201012,12,red woolly hottie white heart.,6,84029E,3.39,17850,United Kingdom,20.34

In [75]:
df_new.invoice_date

0        2010-12-01 08:26:00
1        2010-12-01 08:26:00
2        2010-12-01 08:26:00
3        2010-12-01 08:26:00
4        2010-12-01 08:26:00
                 ...
541904   2011-12-09 12:50:00
541905   2011-12-09 12:50:00
541906   2011-12-09 12:50:00
541907   2011-12-09 12:50:00
541908   2011-12-09 12:50:00
Name: invoice_date, Length: 397924, dtype: datetime64[ns]

#### This project involves cleaning and preparing a retail sales dataset for analysis and potential machine learning tasks. 
##### The dataset is now clean, well-labeled, and ready for:
#####   Visualization (e.g., sales trends)
#####   Trend analysis
#####   Machine learning models (forecasting, clustering, etc.)